; ModuleID = 'native/lib.c'
source_filename = "native/lib.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.12.0"

%struct.enif_func_t = type { i8*, i32, i64 (%struct.enif_environment_t*, i32, i64*)*, i32 }
%struct.enif_environment_t = type opaque
%struct.enif_entry_t = type { i32, i32, i8*, i32, %struct.enif_func_t*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i8**, i64)*, void (%struct.enif_environment_t*, i8*)*, i8*, i32, i64, i8* }
%struct.vector = type { i32, i32* }

@.str = private unnamed_addr constant [16 x i8] c"ArithmeticError\00", align 1
@arithmetic_error = internal unnamed_addr global i64 0, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"ok\00", align 1
@ok_atom = internal unnamed_addr global i64 0, align 8, !dbg !89
@.str.2 = private unnamed_addr constant [6 x i8] c"error\00", align 1
@error_atom = internal unnamed_addr global i64 0, align 8, !dbg !91
@.str.3 = private unnamed_addr constant [17 x i8] c"arithmetic_error\00", align 1
@arithmetic_error_atom = internal unnamed_addr global i64 0, align 8, !dbg !93
@.str.4 = private unnamed_addr constant [13 x i8] c"asm_1_nif_ii\00", align 1
@.str.5 = private unnamed_addr constant [13 x i8] c"asm_1_nif_uu\00", align 1
@.str.6 = private unnamed_addr constant [13 x i8] c"asm_1_nif_bb\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "arithmetic_error", scope: !2, file: !3, line: 61, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !23)
!3 = !DIFile(filename: "native/lib.c", directory: "/Users/zacky/github/nif_llvm")
!4 = !{}
!5 = !{!6, !9, !10, !12, !13, !14, !15, !22}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 43, baseType: !8)
!7 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/zacky/github/nif_llvm")
!8 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !7, line: 44, baseType: !11)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", file: !3, line: 8, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vector", file: !3, line: 5, size: 128, elements: !18)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !3, line: 6, baseType: !11, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !3, line: 7, baseType: !21, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!22 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!23 = !{!24, !53, !0, !89, !91, !93}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "nif_funcs", scope: !2, file: !3, line: 221, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !51)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifFunc", file: !28, line: 112, baseType: !29)
!28 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.1/lib/erlang/erts-10.1/include/erl_nif.h", directory: "/Users/zacky/github/nif_llvm")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_func_t", file: !28, line: 106, size: 256, elements: !30)
!30 = !{!31, !34, !36, !50}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 108, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !29, file: !28, line: 109, baseType: !35, size: 32, offset: 64)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !29, file: !28, line: 110, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !45, !11, !48}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERL_NIF_TERM", file: !28, line: 88, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifUInt", file: !28, line: 84, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt", file: !43, line: 124, baseType: !44)
!43 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.1/lib/erlang/erts-10.1/include/erl_drv_nif.h", directory: "/Users/zacky/github/nif_llvm")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt64", file: !43, line: 110, baseType: !9)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEnv", file: !28, line: 104, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "enif_environment_t", file: !28, line: 103, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !28, line: 111, baseType: !35, size: 32, offset: 192)
!51 = !{!52}
!52 = !DISubrange(count: 8)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "entry", scope: !55, file: !3, line: 234, type: !59, isLocal: true, isDefinition: true)
!55 = distinct !DISubprogram(name: "nif_init", scope: !3, file: !3, line: 234, type: !56, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!56 = !DISubroutineType(types: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEntry", file: !28, line: 138, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_entry_t", file: !28, line: 115, size: 768, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !68, !73, !74, !78, !82, !83, !84, !88}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !60, file: !28, line: 117, baseType: !11, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !60, file: !28, line: 118, baseType: !11, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !28, line: 119, baseType: !32, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_funcs", scope: !60, file: !28, line: 120, baseType: !11, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !60, file: !28, line: 121, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !60, file: !28, line: 122, baseType: !69, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!11, !45, !72, !40}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reload", scope: !60, file: !28, line: 123, baseType: !69, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !60, file: !28, line: 124, baseType: !75, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!11, !45, !72, !72, !40}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "unload", scope: !60, file: !28, line: 125, baseType: !79, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !45, !14}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vm_variant", scope: !60, file: !28, line: 128, baseType: !32, size: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !60, file: !28, line: 131, baseType: !35, size: 32, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof_ErlNifResourceTypeInit", scope: !60, file: !28, line: 134, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 30, baseType: !87)
!86 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/zacky/github/nif_llvm")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !7, line: 92, baseType: !9)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "min_erts", scope: !60, file: !28, line: 137, baseType: !32, size: 64, offset: 704)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "ok_atom", scope: !2, file: !3, line: 62, type: !40, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "error_atom", scope: !2, file: !3, line: 63, type: !40, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "arithmetic_error_atom", scope: !2, file: !3, line: 64, type: !40, isLocal: true, isDefinition: true)
!95 = !{i32 2, !"Dwarf Version", i32 4}
!96 = !{i32 2, !"Debug Info Version", i32 3}
!97 = !{i32 1, !"wchar_size", i32 4}
!98 = !{i32 7, !"PIC Level", i32 2}
!99 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!100 = distinct !DISubprogram(name: "load", scope: !101, file: !101, line: 6, type: !70, isLocal: true, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !102)
!101 = !DIFile(filename: "native/loader.c", directory: "/Users/zacky/github/nif_llvm")
!102 = !{!103, !104, !105}
!103 = !DILocalVariable(name: "env", arg: 1, scope: !100, file: !101, line: 6, type: !45)
!104 = !DILocalVariable(name: "priv", arg: 2, scope: !100, file: !101, line: 6, type: !72)
!105 = !DILocalVariable(name: "info", arg: 3, scope: !100, file: !101, line: 6, type: !40)
!106 = !DILocation(line: 6, column: 17, scope: !100)
!107 = !DILocation(line: 6, column: 29, scope: !100)
!108 = !DILocation(line: 6, column: 48, scope: !100)
!109 = !DILocalVariable(name: "env", arg: 1, scope: !110, file: !3, line: 66, type: !45)
!110 = distinct !DISubprogram(name: "init_nif_llvm", scope: !3, file: !3, line: 66, type: !111, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !45}
!113 = !{!109}
!114 = !DILocation(line: 66, column: 38, scope: !110, inlinedAt: !115)
!115 = distinct !DILocation(line: 8, column: 3, scope: !100)
!116 = !DILocation(line: 68, column: 48, scope: !110, inlinedAt: !115)
!117 = !DILocation(line: 68, column: 22, scope: !110, inlinedAt: !115)
!118 = !DILocation(line: 68, column: 20, scope: !110, inlinedAt: !115)
!119 = !{!120, !120, i64 0}
!120 = !{!"long", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !DILocation(line: 69, column: 13, scope: !110, inlinedAt: !115)
!124 = !DILocation(line: 69, column: 11, scope: !110, inlinedAt: !115)
!125 = !DILocation(line: 70, column: 16, scope: !110, inlinedAt: !115)
!126 = !DILocation(line: 70, column: 14, scope: !110, inlinedAt: !115)
!127 = !DILocation(line: 71, column: 27, scope: !110, inlinedAt: !115)
!128 = !DILocation(line: 71, column: 25, scope: !110, inlinedAt: !115)
!129 = !DILocation(line: 9, column: 3, scope: !100)
!130 = distinct !DISubprogram(name: "unload", scope: !101, file: !101, line: 13, type: !80, isLocal: true, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !131)
!131 = !{!132, !133}
!132 = !DILocalVariable(name: "env", arg: 1, scope: !130, file: !101, line: 13, type: !45)
!133 = !DILocalVariable(name: "priv", arg: 2, scope: !130, file: !101, line: 13, type: !14)
!134 = !DILocation(line: 13, column: 19, scope: !130)
!135 = !DILocation(line: 13, column: 30, scope: !130)
!136 = !DILocation(line: 15, column: 1, scope: !130)
!137 = distinct !DISubprogram(name: "reload", scope: !101, file: !101, line: 18, type: !70, isLocal: true, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !138)
!138 = !{!139, !140, !141}
!139 = !DILocalVariable(name: "env", arg: 1, scope: !137, file: !101, line: 18, type: !45)
