; ModuleID = 'native/lib.c'
source_filename = "native/lib.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.12.0"

%struct.enif_func_t = type { i8*, i32, i64 (%struct.enif_environment_t*, i32, i64*)*, i32 }
%struct.enif_environment_t = type opaque
%struct.enif_entry_t = type { i32, i32, i8*, i32, %struct.enif_func_t*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i8**, i64)*, void (%struct.enif_environment_t*, i8*)*, i8*, i32, i64, i8* }
%struct.vector = type { i32, i64* }

@.str = private unnamed_addr constant [16 x i8] c"ArithmeticError\00", align 1
@arithmetic_error = internal unnamed_addr global i64 0, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"ok\00", align 1
@ok_atom = internal unnamed_addr global i64 0, align 8, !dbg !88
@.str.2 = private unnamed_addr constant [6 x i8] c"error\00", align 1
@error_atom = internal unnamed_addr global i64 0, align 8, !dbg !90
@.str.3 = private unnamed_addr constant [17 x i8] c"arithmetic_error\00", align 1
@arithmetic_error_atom = internal unnamed_addr global i64 0, align 8, !dbg !92
@.str.4 = private unnamed_addr constant [13 x i8] c"asm_1_nif_ii\00", align 1
@.str.5 = private unnamed_addr constant [13 x i8] c"asm_1_nif_uu\00", align 1
@.str.6 = private unnamed_addr constant [13 x i8] c"asm_1_nif_bb\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "arithmetic_error", scope: !2, file: !3, line: 72, type: !39, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !22)
!3 = !DIFile(filename: "native/lib.c", directory: "/Users/zacky/github/nif_llvm")
!4 = !{}
!5 = !{!6, !9, !10, !12, !13, !14, !15, !21}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 43, baseType: !8)
!7 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/zacky/github/nif_llvm")
!8 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !7, line: 44, baseType: !11)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", file: !3, line: 8, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vector", file: !3, line: 5, size: 128, elements: !18)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !3, line: 6, baseType: !11, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !3, line: 7, baseType: !13, size: 64, offset: 64)
!21 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!22 = !{!23, !52, !0, !88, !90, !92}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "nif_funcs", scope: !2, file: !3, line: 241, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !50)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifFunc", file: !27, line: 112, baseType: !28)
!27 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.1/lib/erlang/erts-10.1/include/erl_nif.h", directory: "/Users/zacky/github/nif_llvm")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_func_t", file: !27, line: 106, size: 256, elements: !29)
!29 = !{!30, !33, !35, !49}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !27, line: 108, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !28, file: !27, line: 109, baseType: !34, size: 32, offset: 64)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !28, file: !27, line: 110, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !44, !11, !47}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERL_NIF_TERM", file: !27, line: 88, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifUInt", file: !27, line: 84, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt", file: !42, line: 124, baseType: !43)
!42 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.1/lib/erlang/erts-10.1/include/erl_drv_nif.h", directory: "/Users/zacky/github/nif_llvm")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt64", file: !42, line: 110, baseType: !9)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEnv", file: !27, line: 104, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "enif_environment_t", file: !27, line: 103, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !28, file: !27, line: 111, baseType: !34, size: 32, offset: 192)
!50 = !{!51}
!51 = !DISubrange(count: 8)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "entry", scope: !54, file: !3, line: 254, type: !58, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "nif_init", scope: !3, file: !3, line: 254, type: !55, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !4)
!55 = !DISubroutineType(types: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEntry", file: !27, line: 138, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_entry_t", file: !27, line: 115, size: 768, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !67, !72, !73, !77, !81, !82, !83, !87}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !59, file: !27, line: 117, baseType: !11, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !59, file: !27, line: 118, baseType: !11, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !27, line: 119, baseType: !31, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_funcs", scope: !59, file: !27, line: 120, baseType: !11, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !59, file: !27, line: 121, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !59, file: !27, line: 122, baseType: !68, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!11, !44, !71, !39}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reload", scope: !59, file: !27, line: 123, baseType: !68, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !59, file: !27, line: 124, baseType: !74, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!11, !44, !71, !71, !39}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "unload", scope: !59, file: !27, line: 125, baseType: !78, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !44, !14}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vm_variant", scope: !59, file: !27, line: 128, baseType: !31, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !59, file: !27, line: 131, baseType: !34, size: 32, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof_ErlNifResourceTypeInit", scope: !59, file: !27, line: 134, baseType: !84, size: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 30, baseType: !86)
!85 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/zacky/github/nif_llvm")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !7, line: 92, baseType: !9)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "min_erts", scope: !59, file: !27, line: 137, baseType: !31, size: 64, offset: 704)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "ok_atom", scope: !2, file: !3, line: 73, type: !39, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "error_atom", scope: !2, file: !3, line: 74, type: !39, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "arithmetic_error_atom", scope: !2, file: !3, line: 75, type: !39, isLocal: true, isDefinition: true)
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = !{i32 7, !"PIC Level", i32 2}
!98 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!99 = distinct !DISubprogram(name: "load", scope: !100, file: !100, line: 6, type: !69, isLocal: true, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !101)
!100 = !DIFile(filename: "native/loader.c", directory: "/Users/zacky/github/nif_llvm")
!101 = !{!102, !103, !104}
!102 = !DILocalVariable(name: "env", arg: 1, scope: !99, file: !100, line: 6, type: !44)
!103 = !DILocalVariable(name: "priv", arg: 2, scope: !99, file: !100, line: 6, type: !71)
!104 = !DILocalVariable(name: "info", arg: 3, scope: !99, file: !100, line: 6, type: !39)
!105 = !DILocation(line: 6, column: 17, scope: !99)
!106 = !DILocation(line: 6, column: 29, scope: !99)
!107 = !DILocation(line: 6, column: 48, scope: !99)
!108 = !DILocalVariable(name: "env", arg: 1, scope: !109, file: !3, line: 77, type: !44)
!109 = distinct !DISubprogram(name: "init_nif_llvm", scope: !3, file: !3, line: 77, type: !110, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !44}
!112 = !{!108}
!113 = !DILocation(line: 77, column: 38, scope: !109, inlinedAt: !114)
!114 = distinct !DILocation(line: 8, column: 3, scope: !99)
!115 = !DILocation(line: 79, column: 48, scope: !109, inlinedAt: !114)
!116 = !DILocation(line: 79, column: 22, scope: !109, inlinedAt: !114)
!117 = !DILocation(line: 79, column: 20, scope: !109, inlinedAt: !114)
!118 = !{!119, !119, i64 0}
!119 = !{!"long", !120, i64 0}
!120 = !{!"omnipotent char", !121, i64 0}
!121 = !{!"Simple C/C++ TBAA"}
!122 = !DILocation(line: 80, column: 13, scope: !109, inlinedAt: !114)
!123 = !DILocation(line: 80, column: 11, scope: !109, inlinedAt: !114)
!124 = !DILocation(line: 81, column: 16, scope: !109, inlinedAt: !114)
!125 = !DILocation(line: 81, column: 14, scope: !109, inlinedAt: !114)
!126 = !DILocation(line: 82, column: 27, scope: !109, inlinedAt: !114)
!127 = !DILocation(line: 82, column: 25, scope: !109, inlinedAt: !114)
!128 = !DILocation(line: 9, column: 3, scope: !99)
!129 = distinct !DISubprogram(name: "unload", scope: !100, file: !100, line: 13, type: !79, isLocal: true, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !130)
!130 = !{!131, !132}
!131 = !DILocalVariable(name: "env", arg: 1, scope: !129, file: !100, line: 13, type: !44)
!132 = !DILocalVariable(name: "priv", arg: 2, scope: !129, file: !100, line: 13, type: !14)
!133 = !DILocation(line: 13, column: 19, scope: !129)
!134 = !DILocation(line: 13, column: 30, scope: !129)
!135 = !DILocation(line: 15, column: 1, scope: !129)
!136 = distinct !DISubprogram(name: "reload", scope: !100, file: !100, line: 18, type: !69, isLocal: true, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !137)
!137 = !{!138, !139, !140}
!138 = !DILocalVariable(name: "env", arg: 1, scope: !136, file: !100, line: 18, type: !44)
