; ModuleID = 'native/lib.c'
source_filename = "native/lib.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.12.0"

%struct.enif_func_t = type { i8*, i32, i64 (%struct.enif_environment_t*, i32, i64*)*, i32 }
%struct.enif_environment_t = type opaque
%struct.enif_entry_t = type { i32, i32, i8*, i32, %struct.enif_func_t*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i64)*, i32 (%struct.enif_environment_t*, i8**, i8**, i64)*, void (%struct.enif_environment_t*, i8*)*, i8*, i32, i64, i8* }

@.str = private unnamed_addr constant [14 x i8] c"ArgumentError\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"asm_1_nif_ii\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"asm_1_nif_if\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"asm_1_nif_fi\00", align 1
@.str.4 = private unnamed_addr constant [13 x i8] c"asm_1_nif_ff\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nif_funcs", scope: !2, file: !3, line: 71, type: !76, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.1 (tags/RELEASE_601/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !14)
!3 = !DIFile(filename: "native/lib.c", directory: "/Users/zacky/github/nif_llvm")
!4 = !{}
!5 = !{!6, !9, !10, !12, !13}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 43, baseType: !8)
!7 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/zacky/github/nif_llvm")
!8 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !7, line: 44, baseType: !11)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!14 = !{!0, !15}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "entry", scope: !17, file: !3, line: 79, type: !21, isLocal: true, isDefinition: true)
!17 = distinct !DISubprogram(name: "nif_init", scope: !3, file: !3, line: 79, type: !18, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !4)
!18 = !DISubroutineType(types: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEntry", file: !22, line: 138, baseType: !23)
!22 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.0/lib/erlang/erts-10.0/include/erl_nif.h", directory: "/Users/zacky/github/nif_llvm")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_entry_t", file: !22, line: 115, size: 768, elements: !24)
!24 = !{!25, !26, !27, !30, !31, !54, !60, !61, !65, !69, !70, !71, !75}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !23, file: !22, line: 117, baseType: !11, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !23, file: !22, line: 118, baseType: !11, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !22, line: 119, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_funcs", scope: !23, file: !22, line: 120, baseType: !11, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !23, file: !22, line: 121, baseType: !32, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifFunc", file: !22, line: 112, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "enif_func_t", file: !22, line: 106, size: 256, elements: !35)
!35 = !{!36, !37, !39, !53}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !22, line: 108, baseType: !28, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "arity", scope: !34, file: !22, line: 109, baseType: !38, size: 32, offset: 64)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !34, file: !22, line: 110, baseType: !40, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !48, !11, !51}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ERL_NIF_TERM", file: !22, line: 88, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifUInt", file: !22, line: 84, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt", file: !46, line: 124, baseType: !47)
!46 = !DIFile(filename: "/Users/zacky/.erlenv/releases/21.0/lib/erlang/erts-10.0/include/erl_drv_nif.h", directory: "/Users/zacky/github/nif_llvm")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNapiUInt64", file: !46, line: 110, baseType: !9)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErlNifEnv", file: !22, line: 104, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "enif_environment_t", file: !22, line: 103, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !22, line: 111, baseType: !38, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !23, file: !22, line: 122, baseType: !55, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!11, !48, !58, !43}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reload", scope: !23, file: !22, line: 123, baseType: !55, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !23, file: !22, line: 124, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!11, !48, !58, !58, !43}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "unload", scope: !23, file: !22, line: 125, baseType: !66, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !48, !59}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "vm_variant", scope: !23, file: !22, line: 128, baseType: !28, size: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !23, file: !22, line: 131, baseType: !38, size: 32, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof_ErlNifResourceTypeInit", scope: !23, file: !22, line: 134, baseType: !72, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 30, baseType: !74)
!73 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/zacky/github/nif_llvm")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !7, line: 92, baseType: !9)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "min_erts", scope: !23, file: !22, line: 137, baseType: !28, size: 64, offset: 704)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1024, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 4)
!79 = !{i32 2, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{i32 1, !"wchar_size", i32 4}
!82 = !{i32 7, !"PIC Level", i32 2}
!83 = !{!"clang version 6.0.1 (tags/RELEASE_601/final)"}
!84 = distinct !DISubprogram(name: "load", scope: !85, file: !85, line: 4, type: !56, isLocal: true, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !86)
!85 = !DIFile(filename: "native/loader.c", directory: "/Users/zacky/github/nif_llvm")
!86 = !{!87, !88, !89}
!87 = !DILocalVariable(name: "env", arg: 1, scope: !84, file: !85, line: 4, type: !48)
!88 = !DILocalVariable(name: "priv", arg: 2, scope: !84, file: !85, line: 4, type: !58)
!89 = !DILocalVariable(name: "info", arg: 3, scope: !84, file: !85, line: 4, type: !43)
!90 = !DILocation(line: 4, column: 17, scope: !84)
!91 = !DILocation(line: 4, column: 29, scope: !84)
!92 = !DILocation(line: 4, column: 48, scope: !84)
!93 = !DILocation(line: 6, column: 3, scope: !84)
!94 = distinct !DISubprogram(name: "unload", scope: !85, file: !85, line: 10, type: !67, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !95)
!95 = !{!96, !97}
!96 = !DILocalVariable(name: "env", arg: 1, scope: !94, file: !85, line: 10, type: !48)
!97 = !DILocalVariable(name: "priv", arg: 2, scope: !94, file: !85, line: 10, type: !59)
!98 = !DILocation(line: 10, column: 19, scope: !94)
!99 = !DILocation(line: 10, column: 30, scope: !94)
!100 = !DILocation(line: 12, column: 1, scope: !94)
!101 = distinct !DISubprogram(name: "reload", scope: !85, file: !85, line: 15, type: !56, isLocal: true, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !102)
!102 = !{!103, !104, !105}
!103 = !DILocalVariable(name: "env", arg: 1, scope: !101, file: !85, line: 15, type: !48)
!104 = !DILocalVariable(name: "priv", arg: 2, scope: !101, file: !85, line: 15, type: !58)
!105 = !DILocalVariable(name: "info", arg: 3, scope: !101, file: !85, line: 15, type: !43)
!106 = !DILocation(line: 15, column: 19, scope: !101)
!107 = !DILocation(line: 15, column: 31, scope: !101)
!108 = !DILocation(line: 15, column: 50, scope: !101)
!109 = !DILocation(line: 17, column: 3, scope: !101)
!110 = distinct !DISubprogram(name: "upgrade", scope: !85, file: !85, line: 21, type: !63, isLocal: true, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DILocalVariable(name: "env", arg: 1, scope: !110, file: !85, line: 21, type: !48)
!113 = !DILocalVariable(name: "priv", arg: 2, scope: !110, file: !85, line: 21, type: !58)
!114 = !DILocalVariable(name: "old_priv", arg: 3, scope: !110, file: !85, line: 21, type: !58)
!115 = !DILocalVariable(name: "info", arg: 4, scope: !110, file: !85, line: 21, type: !43)
!116 = !DILocation(line: 21, column: 20, scope: !110)
!117 = !DILocation(line: 21, column: 32, scope: !110)
!118 = !DILocation(line: 21, column: 45, scope: !110)
!119 = !DILocation(line: 21, column: 68, scope: !110)
!120 = !DILocation(line: 23, column: 3, scope: !110)
!121 = distinct !DISubprogram(name: "asm_1_nif_ii", scope: !3, file: !3, line: 6, type: !41, isLocal: true, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !122)
!122 = !{!123, !124, !125, !126, !128, !129}
!123 = !DILocalVariable(name: "env", arg: 1, scope: !121, file: !3, line: 6, type: !48)
!124 = !DILocalVariable(name: "argc", arg: 2, scope: !121, file: !3, line: 6, type: !11)
!125 = !DILocalVariable(name: "argv", arg: 3, scope: !121, file: !3, line: 6, type: !51)
!126 = !DILocalVariable(name: "a", scope: !121, file: !3, line: 7, type: !127)
